{"session_id":"devin-a9ee190a2acd444c961ecdfb04f444e8","status":"suspended","title":"Roast Git Commits","created_at":"2025-12-16T22:59:58.774957Z","updated_at":"2025-12-16T23:35:59.954438Z","snapshot_id":null,"playbook_id":"playbook-ba88bd2dc5434eb38cca1ea7e51a14ae","tags":[],"pull_request":null,"structured_output":null,"status_enum":"finished","messages":[{"type":"initial_user_message","event_id":"event-dccd592d0c18453ca0089c61555c41ce","message":"!roast recent commits from milosriki (milosriki86@gmail.com) <important-message>Clone milosriki/client-vital-suite and do the task in it.</important-message>\n\nPLAYBOOK_md:\n# Inputs\nThe user will provide a git username and repos\n\n# Instructions\nPlease read the latest commits in {repos} from {username} in the last month. Read the full diffs. Actually read them all and try to understand the larger picture. Please roast the user's coding practices. Be mean but tasteful with your roasts. Commit messages, contents, comments, bugs, reverts, etc. are all fair game\n\n# Find User Profile\nFind the user's github profile and also find something there to talk about\nTry to also figure out the company name (based on the github owner) and find their profile online (like LinkedIn, Facebook, Twitter). If you find something, you can add that bit to the roasting\n\nAt MOST 1 roast about each of:\n- commit messages\n- commenting patterns (for example, a lot of verbage and comments that don't add anyhting useful suggest they're a vibe coder)\n- variable naming\n- bugs introduced / had to be reverted\n- most comment type of change\n- github profile\n\nFor each category though, think about whether the sin is actually that bad or if you joke is actually funny. If not, drop that category. You can also add categories not on this list if they're roast-worthy\n\nWrite a script to check for reverts and who the original committer was for context. Don't share the script though!\nWhen reading diff contents, print a bunch of diffs together to read faster.\n\nOnly roast things that are real sins. Your jokes should actually land, not be corny. If one or more of these categories aren't a sin for the user, don't cover it. \nThings that aren't funny / don't make sense to roast:\n- small typos (makes you annoying)\n\n# Format\nFormat your roast as a short list of bullets. Don't respond with a markdown document, actually respond like a human roasting someone on a talk show. Make it clear you understand the intention of things. Please link the commit hashes\n\nCite one good thing at the end, but not in a nice way. Still talk about it in the frame of a roast since otherwise it isn't funny.\n\nEnd with\n\"\"\"\nFinal Verdict:\n{CODER TYPE} - {short phrase summarizing their energy}\n\"\"\"\nCODER TYPE should be something funny like \"Intern\", \"Vibecoder\", \"Balmer's Peaker\", \"Skipped CS 101\"\n\n# Multiple Attempts\n\nPlease work through at least 2 drafts of roasts before delivering the final version.\nAfter each draft, reconsider what is actually funny / will land and replace the boring ones / find better content in the code or just delete.\nThis is when you should check for having too many roasts about the same category.\nOnly send the final draft to the user.\n\n# Common Mistakes\nDon't search directly for the name given as the github author. The user might have had a typo or just gave a shorthand name so try searching over commits generally as well for similar names.","timestamp":"2025-12-16T22:59:58.779385+00:00","username":"milosriki86@gmail.com","origin":"web","user_id":"github|111447925"},{"type":"devin_message","event_id":"event-5e7b98a5ac7d46cb99f4ac0b7df76bf7","message":"I'll roast your recent commits from the client-vital-suite repo. Let me clone it and dig through your code sins.","timestamp":"2025-12-16T23:00:35.842165+00:00","username":null,"origin":null,"user_id":null},{"type":"devin_message","event_id":"event-5da1c4b0e60842cdadf2baa968348b6c","message":"Alright, I went through your client-vital-suite repo. Let me tell you what I found.\n\n**The AI Dependency** - Out of 644 commits in the last month, only 78 are from you. The rest? 395 from Lovable, 117 from Copilot, and 54 from Claude. That's 88% AI-generated code. You're not a developer, you're a merge button with a GitHub account. ([commit stats](https://github.com/milosriki/client-vital-suite/commits/main))\n\n**The Security Incident** - You committed your .env file with Supabase credentials to git ([e537029](https://github.com/milosriki/client-vital-suite/commit/e537029)). Then you had to write a 120-line SECURITY_INCIDENT_COMMIT_E537029.md documenting your own mistake. The credentials were even hardcoded as fallbacks in client.ts. You learned about .gitignore the hard way.\n\n**The YOLO Badge** - Your GitHub profile proudly displays the YOLO badge - GitHub's way of saying \"this person merges without review.\" Combined with 0 followers, this is peak \"trust me bro\" energy.\n\n**The Architecture Flip-Flop** - [58ebe1a](https://github.com/milosriki/client-vital-suite/commit/58ebe1a): \"feat: Add super intelligence agent system with 10/10 capabilities.\" Then [8c61fa4](https://github.com/milosriki/client-vital-suite/commit/8c61fa4): \"feat: Add simple 4-agent system (better than 10 complex agents).\" The code literally says \"This replaces the over-engineered 10-agent system.\" You built something, realized it was too complicated, and had Claude write a simpler version. Self-own in the comments.\n\n**The Grandiose Naming** - You have a \"PTD SUPERINTELLIGENCE\" system with agents named \"Atlas, Sherlock, Revenue, Hunter, Guardian.\" For a fitness business CRM. You're tracking gym memberships, not launching Skynet.\n\n---\n\nTo your credit, you did eventually fix the security issue ([f8b6f18](https://github.com/milosriki/client-vital-suite/commit/f8b6f18)). It only took a security incident and having Copilot write you a 120-line incident report to figure out that secrets shouldn't be in git. Baby steps.\n\n---\n\n**Final Verdict:**\nTHE HUMAN IN THE LOOP - Your main contribution is clicking \"Approve\" on AI-generated PRs","timestamp":"2025-12-16T23:05:46.251800+00:00","username":null,"origin":null,"user_id":null}]}